//==================================================
// [ColliderBaseComponent.CPP] 当たり判定の基底クラスコンポーネントのCPPファイル
// 著者：尾上莉奈
//--------------------------------------------------
// 説明：当たり判定のベースコンポーネント
//==================================================
/*----- インクルード -----*/
#include "ColliderBaseComponent.h"
//--------------------------------------------------
// @brief コンストラクタ
//--------------------------------------------------
ColliderBaseComponent::ColliderBaseComponent(GameObject* _owner, int _updateOrder)
	:Component(_owner, _updateOrder)
{
}
//--------------------------------------------------
// @brief デストラクタ
//--------------------------------------------------
ColliderBaseComponent::~ColliderBaseComponent()
{
}
