//==================================================
// [RailComponent.cpp] レールコンポーネント
// 著者：有馬啓太
//--------------------------------------------------
// 説明：レールコンポーネントの定義
//==================================================
/*----- インクルード -----*/
#include <SimpleMath.h>

#include "RailComponent.h"

using namespace DirectX::SimpleMath;
//--------------------------------------------------
// @brief コンストラクタ
//--------------------------------------------------
RailComponent::RailComponent(GameObject* _owner, const Vector3& _startPos, const Vector3& _endPos, int _updateOrder)
	:Component(_owner, _updateOrder)
{

	this->Init();
}


//--------------------------------------------------
// @brief デストラクタ
//--------------------------------------------------
RailComponent::~RailComponent()
{
	this->Uninit();
}

//--------------------------------------------------
// @brief 初期化処理
//--------------------------------------------------
void RailComponent::Init()
{
}
//--------------------------------------------------
// @brief 終了処理
//--------------------------------------------------
void RailComponent::Uninit()
{

}
//--------------------------------------------------
// @brief 更新処理
//--------------------------------------------------
void RailComponent::Update()
{
}
