////==================================================
//// [SteePillarComponent.cpp] 鉄柱ギミックコンポーネントソース
//// 著者：有馬啓太
////--------------------------------------------------
//// 説明：鉄柱ギミックコンポーネントの定義
////==================================================
///*----- インクルード -----*/
////#include "SteePillarComponent.h"
////--------------------------------------------------
//// @brief コンストラクタ
////--------------------------------------------------
//SteePillarComponent::SteePillarComponent(GameObject* _owner, int _updateOrder)
//	:Component(_owner, _updateOrder)
//{
//
//	this->Init();
//}
//
//
////--------------------------------------------------
//// @brief デストラクタ
////--------------------------------------------------
//SteePillarComponent::~SteePillarComponent()
//{
//	this->Uninit();
//}
//
////--------------------------------------------------
//// @brief 初期化処理
////--------------------------------------------------
//void SteePillarComponent::Init()
//{
//}
////--------------------------------------------------
//// @brief 終了処理
////--------------------------------------------------
//void SteePillarComponent::Uninit()
//{
//
//}
////--------------------------------------------------
//// @brief 更新処理
////--------------------------------------------------
//void SteePillarComponent::Update()
//{
//}
