//==================================================
// [WeakFloorComponent.cpp] 脆い床ギミックコンポーネントソース
// 著者：有馬啓太
//--------------------------------------------------
// 説明：脆い床ギミックコンポーネントの定義
//==================================================
/*----- インクルード -----*/
#include "WeakFloorComponent.h"
//--------------------------------------------------
// @brief コンストラクタ
//--------------------------------------------------
WeakFloorComponent::WeakFloorComponent(GameObject* _owner, int _updateOrder)
	:Component(_owner, _updateOrder)
{

	this->Init();
}


//--------------------------------------------------
// @brief デストラクタ
//--------------------------------------------------
WeakFloorComponent::~WeakFloorComponent()
{
	this->Uninit();
}

//--------------------------------------------------
// @brief 初期化処理
//--------------------------------------------------
void WeakFloorComponent::Init()
{
}
//--------------------------------------------------
// @brief 終了処理
//--------------------------------------------------
void WeakFloorComponent::Uninit()
{

}
//--------------------------------------------------
// @brief 更新処理
//--------------------------------------------------
void WeakFloorComponent::Update()
{
}
