//==================================================
// [Camera.cpp] カメラオブジェクト
// 著者：有馬啓太
//--------------------------------------------------
// 説明：カメラの定義
//==================================================

#include "../../StdAfx.h"
#include "Camera.h"
#include "../../GameManager.h"
#include "../Component/CameraComponent.h"

//--------------------------------------------------
// コンストラクタ
//--------------------------------------------------
Camera::Camera(GameManager* _gameManager)
	:GameObject(_gameManager)
{
	std::cout << "＜カメラ＞ -> 生成\n";
	camera_component_ = std::make_unique<CameraComponent>(this);
}

//--------------------------------------------------
// デストラクタ
//--------------------------------------------------
Camera::~Camera()
{
	std::cout << "＜カメラオブジェクト＞ -> 破棄\n";
}

//--------------------------------------------------
// 更新処理
//--------------------------------------------------
void Camera::UpdateGameObject()
{

}
