//==================================================
// [Camera.cpp] カメラオブジェクト
// 著者：有馬啓太
//--------------------------------------------------
// 説明：カメラの定義
//==================================================

/*----- インクルード -----*/
#include "Camera.h"
#include "../Component/CameraComponent.h"

//--------------------------------------------------
// コンストラクタ
//--------------------------------------------------
Camera::Camera(GameManager* _gameManager)
	:GameObject(_gameManager)
{
	std::format("{}", "＜Camera＞ -> new\n");

	// カメラコンポーネント
	camera_component_ = new CameraComponent(this);
	
}

//--------------------------------------------------
// デストラクタ
//--------------------------------------------------
Camera::~Camera()
{
	std::format("{}", "＜Camera＞ -> delete\n");
}

//--------------------------------------------------
// 更新処理
//--------------------------------------------------
void Camera::UpdateGameObject()
{

}
