////==================================================
//// [SteePillarFloorDown.cpp] 鉄柱ギミックコンポーネントソース
//// 著者：有馬啓太
////--------------------------------------------------
//// 説明：鉄柱ギミックコンポーネントの定義
////==================================================
///*----- インクルード -----*/
//#include "SteePillarFloorDown.h"
////--------------------------------------------------
//// @brief コンストラクタ
////--------------------------------------------------
//SteePillarFloorMove::SteePillarFloorMove(GameObject* _owner, int _updateOrder)
//	:Component(_owner, _updateOrder)
//{
//
//	this->Init();
//}
//
//
////--------------------------------------------------
//// @brief デストラクタ
////--------------------------------------------------
//SteePillarFloorMove::~SteePillarFloorMove()
//{
//	this->Uninit();
//}
//
////--------------------------------------------------
//// @brief 初期化処理
////--------------------------------------------------
//void SteePillarFloorMove::Init()
//{
//}
////--------------------------------------------------
//// @brief 終了処理
////--------------------------------------------------
//void SteePillarFloorMove::Uninit()
//{
//
//}
////--------------------------------------------------
//// @brief 更新処理
////--------------------------------------------------
//void SteePillarFloorMove::Update()
//{
//}
