//==================================================
// [Logger.h] デバッグログモジュールヘッダ
// 著者：有馬啓太
//--------------------------------------------------
// 説明：デバッグ用にコンソールウィンドウを表示したりする
//==================================================
#ifndef CREATE_CONSOLE_H
#define CREATE_CONSOLE_H

/*----- インクルード -----*/
#include "../StdAfx.h"

/*----- 構造体定義 -----*/
enum class LogLevel
{
	Info
	,Warn
	,Error
};

/*----- 前方宣言 -----*/

//--------------------------------------------------
// デバッグクラス
//--------------------------------------------------
class Logger
{
public:
	static void Log(const std::string& message, LogLevel = LogLevel::Info);
	static void Initialize();
	static void Sutdown();

};


#endif	// CREATE_CONSOLE_H
//==================================================
//				End of FIle
//==================================================

