//==================================================
// [Audio.cpp] オーディオオブジェクト
// 著者：中谷凌也
//--------------------------------------------------
// 説明：サウンドの制御をおこなうクラス
//==================================================

#include "Audio.h"

//--------------------------------------------------
// 初期化
//--------------------------------------------------

HRESULT Audio::Init()
{
	HRESULT hr;

	// COMコンポーネントの初期化
	// ハ―サルト使ってエラーチェックする（下２つも）(エラーコードを出す！！！cerr << hr)
	hr = CoInitializeEx(NULL, COINIT_MULTITHREADED);
	if (FAILED(hr)) {
		std::cerr << "COMの初期化に失敗しました　エラーコード：" << hr << std::endl;
		CoUninitialize();
		return -1;
	}

	// XAudio2の初期化

	// マスターボイスの作成


	// サブミックスボイスの作成？暫く放置


	//完了、戻り値を返す
}

//--------------------------------------------------
// 解放処理
//--------------------------------------------------

void Audio::Uninit()
{
	
}

void Audio::Play(SoundLabel _label)
{

}

void Audio::Stop(SoundLabel _label)
{

}