//==================================================
// [Audio.cpp] オーディオオブジェクト
// 著者：中谷凌也
//--------------------------------------------------
// 説明：サウンドの制御をおこなうクラス
//==================================================

#include "Audio.h"

//--------------------------------------------------
// 初期化
//--------------------------------------------------

HRESULT Audio::Init()
{
	HRESULT hr;

	// COMコンポーネントの初期化
	// ハ―サルト使ってエラーチェックする（下２つも）

	// XAudio2の初期化

	// マスターボイスの作成


	// サブミックスボイスの作成？暫く放置


	//完了、戻り値を返す
}

//--------------------------------------------------
// 解放処理
//--------------------------------------------------

void Audio::Uninit()
{
	
}

void Audio::Play(SoundLabel _label)
{

}

void Audio::Stop(SoundLabel _label)
{

}