//==================================================
// [main.h] メインモジュールヘッダ
// 著者：有馬啓太
//--------------------------------------------------
// 説明：とてもメイン
//==================================================
#ifndef MAIN_H_
#define MAIN_H_

#undef UNICODE

/*----- インクルード -----*/

/*----- 構造体定義 -----*/

/*----- 前方宣言 -----*/

//--------------------------------------------------
// メモゾーン
//--------------------------------------------------
// 
// ====== 今後の実装予定 =========
// GetComponentのnullptr事件
// とりあえず今は仮でTransformを受け渡せるようにしたほうがいい 
// 
// AddComponentで既に同じComponentがあった時に重複を防ぐ処理があったほうがいいかも
// 
// SceneMnagerの実装をする
// 
// 
//
//

#endif	// MAIN_H_