//==================================================
// [main.h] メインモジュールヘッダ
// 著者：有馬啓太
//--------------------------------------------------
// 説明：とてもメイン
//==================================================
#ifndef MAIN_H_
#define MAIN_H_

#undef UNICODE

/*----- インクルード -----*/

/*----- 構造体定義 -----*/

/*----- 前方宣言 -----*/

//--------------------------------------------------
// メモゾーン
//--------------------------------------------------
// 
// GetComponentのnullptr事件
// そもそも例外処理がスローされちゃう
// AddComponentで既に同じComponentがあった時に重複を防ぐ処理があったほうがいい 
//
//

#endif	// MAIN_H_