//==================================================
// [main.h] メインモジュールヘッダ
// 著者：有馬啓太
//--------------------------------------------------
// 説明：とてもメイン
//==================================================
#ifndef MAIN_H_
#define MAIN_H_

#undef UNICODE

/*----- インクルード -----*/

/*----- 構造体定義 -----*/

/*----- 前方宣言 -----*/

//--------------------------------------------------
// メモゾーン
//--------------------------------------------------
// welcome to めちゃくちゃこーど zone
// 
// ====== 今後の実装予定 =========
// メモリリーク
// タイトルの時点で3行分
// item生成で3だか4行分だった気だする
// event関係でどっかdelete忘れとかかもだし今後暇があれば探す
// 
// ログは別にしましょう！！！！！！！！！！！！！！！！！
// 
//

#endif	// MAIN_H_