//==================================================
// [RigidbodyComponent.cpp] 物理演算コンポーネント
// 著者：中谷凌也
//--------------------------------------------------
// 説明：物理演算をおこなうクラス
//		１．位置、速度
//		２．重力
//		３．衝突検出		（ColliderComponentでやる！）
//		４．角速度、回転
//		５．制約
//		６．（デバッグ）
//==================================================

#include "RigidbodyComponent.h"

//--------------------------------------------------
// コンストラクタ
//--------------------------------------------------
RigidbodyComponent::RigidbodyComponent(GameObject* _owner, int _updateOrder)
	:Component(_owner, _updateOrder){
}

//--------------------------------------------------
// デストラクタ
//--------------------------------------------------
RigidbodyComponent::~RigidbodyComponent(){
	Uninit();
}

//--------------------------------------------------
// 初期化処理
//--------------------------------------------------
void RigidbodyComponent::Init(){

}

//--------------------------------------------------
// 終了処理
//--------------------------------------------------
void RigidbodyComponent::Uninit(){

}

//--------------------------------------------------
// 更新処理
//--------------------------------------------------
void RigidbodyComponent::Update() {

}